In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sqlalchemy as sq

In [2]:
conn_str = 'mysql+mysqlconnector://root:anayak_98@localhost:3306/baby_names_db'
engine = sq.create_engine(conn_str)
connec = engine.connect()
try:
    print('Connection successful.')
except:
    print('Error in correction.')

Connection successful.

In [3]:
inspec = sq.inspect(engine)
tables = inspec.get_table_names()
tables

['names', 'regions']

In [4]:
dataframes = {}
for table in tables:
    df = pd.read_sql_table(table, connec)
    var_name = f"df_{table}"
    globals()[var_name] = df
    print(f"Created Dataframe: {var_name}")

Created Dataframe: df_names
Created Dataframe: df_regions

In [5]:
df_names.head()

  State Gender  Year      Name  Births
0    AK      F  1980   Jessica     116
1    AK      F  1980  Jennifer     114
2    AK      F  1980     Sarah      82
3    AK      F  1980    Amanda      71
4    AK      F  1980   Melissa      65

In [6]:
df_names.isna().sum()

State     0
Gender    0
Year      0
Name      0
Births    0
dtype: int64

#### <center> Section - A [Track changes in Name Popularity] </center>
Your first objective is to see how the most popular names have changed over time, and also to identify the names that have jumped the most in terms of popularity. <br>
**Tasks**:
1. Find the overall most popular girl and boy names and show how they have changed in popularity rankings over the years.
2. Find the names with the biggest jumps in popularity from the first year of the data set to the last year

In [7]:
df_names.columns = [i.lower() for i in df_names.columns]
df_names.columns

Index(['state', 'gender', 'year', 'name', 'births'], dtype='object')

In [8]:
df_names[df_names['gender'] == 'F'].groupby('name')['births'].sum().nlargest(1)

name
Jessica    863121
Name: births, dtype: int64

In [9]:
df_names[df_names['gender'] == 'M'].groupby('name')['births'].sum().nlargest(1)

name
Michael    1376418
Name: births, dtype: int64

In [10]:
# Filter the DataFrame for only female names
girl_names = df_names[df_names['gender'] == 'F']

# Step 1: Group by year and name, then sum the births
girl_names_grouped = girl_names.groupby(['year', 'name'], as_index=False)['births'].sum()

# Step 2: Rank the names for each year based on the number of births
girl_names_grouped['rank_pop'] = girl_names_grouped.groupby('year')['births'].rank(method='first', ascending=False)

# Step 3: Find the most popular girl's name across all years
most_popular_name = girl_names.groupby('name')['births'].sum().idxmax()

# Step 4: Filter for the most popular name in the ranked list
result = girl_names_grouped[girl_names_grouped['name'] == most_popular_name]

result

        year     name  births  rank_pop
1455    1980  Jessica   33923       3.0
5166    1981  Jessica   42530       2.0
8922    1982  Jessica   45444       2.0
12696   1983  Jessica   45281       2.0
16448   1984  Jessica   45854       2.0
20299   1985  Jessica   48345       1.0
24268   1986  Jessica   52668       1.0
28329   1987  Jessica   55988       1.0
32569   1988  Jessica   51537       1.0
37040   1989  Jessica   47882       1.0
41750   1990  Jessica   46473       1.0
46649   1991  Jessica   43396       2.0
51530   1992  Jessica   38354       2.0
56483   1993  Jessica   34987       1.0
61399   1994  Jessica   32118       1.0
66292   1995  Jessica   27934       1.0
71146   1996  Jessica   24194       2.0
75995   1997  Jessica   21042       2.0
80813   1998  Jessica   18235       8.0
85816   1999  Jessica   16346       9.0
90927   2000  Jessica   15706       8.0
96202   2001  Jessica   13919      11.0
101535  2002  Jessica   11915      16.0
106977  2003  Jessica   10446      18.0
112613  2004  Jessica    9469      21.0
118311  2005  Jessica    8109      27.0
124107  2006  Jessica    6810      32.0
130114  2007  Jessica    5706      42.0
136123  2008  Jessica    4727      60.0
142214  2009  Jessica    3783      78.0

In [11]:
# Filter the DataFrame for only female names
boy_names = df_names[df_names['gender'] == 'M']

# Step 1: Group by year and name, then sum the births
boy_names_grouped = boy_names.groupby(['year', 'name'], as_index=False)['births'].sum()

# Step 2: Rank the names for each year based on the number of births
boy_names_grouped['rank_pop'] = boy_names_grouped.groupby('year')['births'].rank(method='first', ascending=False)

# Step 3: Find the most popular girl's name across all years
most_popular_name = boy_names.groupby('name')['births'].sum().idxmax()

# Step 4: Filter for the most popular name in the ranked list
result = boy_names_grouped[boy_names_grouped['name'] == most_popular_name]

result

        year     name  births  rank_pop
1665    1980  Michael   68680       1.0
4194    1981  Michael   68765       1.0
6773    1982  Michael   68228       1.0
9400    1983  Michael   67993       1.0
12014   1984  Michael   67732       1.0
14714   1985  Michael   64899       1.0
17522   1986  Michael   64202       1.0
20429   1987  Michael   63642       1.0
23417   1988  Michael   64123       1.0
26751   1989  Michael   65381       1.0
30236   1990  Michael   65276       1.0
33774   1991  Michael   60783       1.0
37351   1992  Michael   54387       1.0
40980   1993  Michael   49552       1.0
44653   1994  Michael   44467       1.0
48244   1995  Michael   41403       1.0
51810   1996  Michael   38364       1.0
55419   1997  Michael   37548       1.0
59066   1998  Michael   36614       1.0
62821   1999  Michael   33908       2.0
66663   2000  Michael   32033       2.0
70590   2001  Michael   29679       2.0
74556   2002  Michael   28245       2.0
78594   2003  Michael   27114       2.0
82805   2004  Michael   25448       2.0
87022   2005  Michael   23807       2.0
91319   2006  Michael   22630       2.0
95727   2007  Michael   21979       2.0
100188  2008  Michael   20609       2.0
104659  2009  Michael   18927       3.0

In [12]:
# Step 1: Group by year and name, and calculate total births
all_names = df_names.groupby(['year', 'name'], as_index=False)['births'].sum()

# Step 2: Get the minimum and maximum years
min_year = all_names['year'].min()
max_year = all_names['year'].max()

# Step 3: Filter data for the minimum and maximum years
names_min_year = all_names[all_names['year'] == min_year].copy()
names_max_year = all_names[all_names['year'] == max_year].copy()

# Step 4: Rank names in each year based on the number of births (descending order)
names_min_year['rank_pop'] = names_min_year.groupby('year')['births'].rank(method='first', ascending=False)
names_max_year['rank_pop'] = names_max_year.groupby('year')['births'].rank(method='first', ascending=False)

# Step 5: Merge the DataFrames for min and max year on the 'name' column
merged_df = pd.merge(names_min_year[['name', 'year', 'rank_pop']],
                     names_max_year[['name', 'year', 'rank_pop']],
                     on='name', suffixes=('_min', '_max'))

# Step 6: Calculate the difference in rank between the max and min years
merged_df['diff_pop'] = merged_df['rank_pop_max'] - merged_df['rank_pop_min']

# Step 7: Sort the result by the difference in ranking
merged_df = merged_df.sort_values(by='diff_pop')

merged_df

        name  year_min  rank_pop_min  year_max  rank_pop_max  diff_pop
3154  Skylar      1980        5667.0      2009         313.0   -5354.0
2990   Rylan      1980        5601.0      2009         320.0   -5281.0
2964   Rowan      1980        5595.0      2009         445.0   -5150.0
728   Colton      1980        5103.0      2009         149.0   -4954.0
54     Aidan      1980        4995.0      2009         109.0   -4886.0
...      ...       ...           ...       ...           ...       ...
2753  Quiana      1980        1073.0      2009        9663.0    8590.0
3307   Timmy      1980        1200.0      2009        9858.0    8658.0
1941   Kerri      1980         444.0      2009        9327.0    8883.0
2983   Rusty      1980         763.0      2009        9716.0    8953.0
3323   Tonia      1980         881.0      2009        9863.0    8982.0

[3556 rows x 6 columns]

#### <center> Section-B [Compare popularity across decades] </center>
Your second objective is to find the top 3 girl names and top 3 boy names for each year, and also for each decade.<br>
**Tasks**:
1. For each year, return the 3 most popular girl names and 3 most popular boy names.
2. For each decade, return the 3 most popular girl names and 3 most popular boy names.

In [13]:
# 3 Most Popular Girl Names per Year
# Filter data for only female names
girl_names = df_names[df_names['gender'] == 'F']

# Group by year and name, and sum the births
girl_names_grouped = girl_names.groupby(['year', 'name'], as_index=False)['births'].sum()

# Rank the names within each year based on the number of births (descending order)
girl_names_grouped['rank_pop'] = girl_names_grouped.groupby('year')['births'].rank(method='first', ascending=False)

# Filter for the top 3 names in each year
top_3_per_year = girl_names_grouped[girl_names_grouped['rank_pop'] <= 3]

# Sort the result by year and rank_pop
top_3_per_year = top_3_per_year.sort_values(['year', 'rank_pop'])

# Display the result
top_3_per_year[['year', 'name', 'rank_pop']]

        year      name  rank_pop
1436    1980  Jennifer       1.0
125     1980    Amanda       2.0
1455    1980   Jessica       3.0
5143    1981  Jennifer       1.0
5166    1981   Jessica       2.0
...      ...       ...       ...
135721  2008  Isabella       2.0
135209  2008     Emily       3.0
141812  2009  Isabella       1.0
141294  2009      Emma       2.0
144080  2009    Olivia       3.0

[90 rows x 3 columns]

In [14]:
# 3 Most Popular Boy Names per Year
# Filter data for only Male names
girl_names = df_names[df_names['gender'] == 'M']

# Group by year and name, and sum the births
boy_names_grouped = girl_names.groupby(['year', 'name'], as_index=False)['births'].sum()

# Rank the names within each year based on the number of births (descending order)
boy_names_grouped['rank_pop'] = boy_names_grouped.groupby('year')['births'].rank(method='first', ascending=False)

# Filter for the top 3 names in each year
top_3_per_year = boy_names_grouped[boy_names_grouped['rank_pop'] <= 3]

# Sort the result by year and rank_pop
top_3_per_year = top_3_per_year.sort_values(['year', 'rank_pop'])

# Display the result
top_3_per_year[['year', 'name', 'rank_pop']]

        year         name  rank_pop
1665    1980      Michael       1.0
419     1980  Christopher       2.0
1145    1980        Jason       3.0
4194    1981      Michael       1.0
2953    1981  Christopher       2.0
...      ...          ...       ...
100188  2008      Michael       2.0
98545   2008        Ethan       3.0
103452  2009        Jacob       1.0
102988  2009        Ethan       2.0
104659  2009      Michael       3.0

[90 rows x 3 columns]

In [15]:
# # Most Popular Girl Names per Decade
# Filter data for only female names
girl_names = df_names[df_names['gender'] == 'F']

# Step 1: Calculate the decade by flooring the year
girl_names['decade'] = (girl_names['year'] // 10) * 10

# Group by decade and name, and sum the births
girl_names_grouped = girl_names.groupby(['decade', 'name'], as_index=False)['births'].sum()

# Step 2: Rank the names within each decade based on the number of births (descending order)
girl_names_grouped['rank_pop'] = girl_names_grouped.groupby('decade')['births'].rank(method='first', ascending=False)

# Step 3: Filter for the top 3 names in each decade
top_3_per_decade = girl_names_grouped[girl_names_grouped['rank_pop'] <= 3]

# Sort the result by decade and rank_pop
top_3_per_decade = top_3_per_decade.sort_values(['decade', 'rank_pop'])

# Display the result
top_3_per_decade[['decade', 'name', 'rank_pop']]

C:\Users\dell\AppData\Local\Temp\ipykernel_12500\3714406067.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  girl_names['decade'] = (girl_names['year'] // 10) * 10

       decade      name  rank_pop
2925     1980   Jessica       1.0
2882     1980  Jennifer       2.0
255      1980    Amanda       3.0
11302    1990   Jessica       1.0
8288     1990    Ashley       2.0
10068    1990     Emily       3.0
19823    2000     Emily       1.0
23174    2000   Madison       2.0
19830    2000      Emma       3.0

In [16]:
# # Most Popular Girl Names per Decade
# Filter data for only female names
boy_names = df_names[df_names['gender'] == 'M']

# Step 1: Calculate the decade by flooring the year
boy_names['decade'] = (boy_names['year'] // 10) * 10

# Group by decade and name, and sum the births
boy_names_grouped = boy_names.groupby(['decade', 'name'], as_index=False)['births'].sum()

# Step 2: Rank the names within each decade based on the number of births (descending order)
boy_names_grouped['rank_pop'] = boy_names_grouped.groupby('decade')['births'].rank(method='first', ascending=False)

# Step 3: Filter for the top 3 names in each decade
top_3_per_decade = boy_names_grouped[boy_names_grouped['rank_pop'] <= 3]

# Sort the result by decade and rank_pop
top_3_per_decade = top_3_per_decade.sort_values(['decade', 'rank_pop'])

# Display the result
top_3_per_decade[['decade', 'name', 'rank_pop']]

C:\Users\dell\AppData\Local\Temp\ipykernel_12500\3574658875.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  boy_names['decade'] = (boy_names['year'] // 10) * 10

       decade         name  rank_pop
3333     1980      Michael       1.0
824      1980  Christopher       2.0
3265     1980      Matthew       3.0
9350     1990      Michael       1.0
6074     1990  Christopher       2.0
9269     1990      Matthew       3.0
14596    2000        Jacob       1.0
16610    2000      Michael       2.0
15296    2000       Joshua       3.0

#### <center>Section - C [Compare popularity across regions]</center>
Your third objective is to find the number of babies born in each region, and also return the top 3 girl names and top 3 boy names within each region.<br>
**Tasks**:
1. Return the number of babies born in each of the six regions (NOTE: The state of MI should be in the Midwest region).
2. Return the 3 most popular girl names and 3 most popular boy names within each region.

In [17]:
df_regions.columns, df_regions.isna().sum()

(Index(['State', 'Region'], dtype='object'),
 State     0
 Region    0
 dtype: int64)

In [18]:
df_regions.columns = [i.lower() for i in df_regions.columns]
df_regions.columns

Index(['state', 'region'], dtype='object')

In [19]:
# Step 1: Clean the regions and add Michigan (MI) to the Midwest region
df_regions['clean_region'] = df_regions['region'].apply(lambda x: 'New_England' if x == 'New England' else x)

# Create a new DataFrame for MI and Midwest region
mi_region = pd.DataFrame({'state': ['MI'], 'clean_region': ['Midwest']})

# Use pd.concat() to add the MI row to the regions DataFrame
df_regions = pd.concat([df_regions, mi_region], ignore_index=True)

# Step 2: Perform the left join between names and clean regions
merged_data = pd.merge(df_names, df_regions[['state', 'clean_region']], how='left', on='state')

# Step 3: Group by clean_region and calculate the total number of births in each region
births_per_region = merged_data.groupby('clean_region')['births'].sum().reset_index()

births_per_region

   clean_region    births
0  Mid_Atlantic  13742667
1       Midwest  22676130
2      Mountain   6282217
3   New_England   4269213
4       Pacific  17540716
5         South  34219920

In [24]:
# Assuming `df_names` is the DataFrame with names data and `df_regions` with regions data

# Step 1: Clean the regions data
def clean_regions(df_regions):
    # Replace 'New England' with 'New_England' and add Michigan manually
    df_regions['clean_region'] = df_regions['region'].replace('New England', 'New_England')
    
    # Adding Michigan ('MI') as 'Midwest'
    df_michigan = pd.DataFrame({'state': ['MI'], 'clean_region': ['Midwest']})
    
    # Concatenate original regions with Michigan data
    return pd.concat([df_regions[['state', 'clean_region']], df_michigan])

# Step 2: Calculate the total number of births per region, gender, and name
def get_babies_per_region(df_names, df_clean_regions):
    # Left join the names and cleaned regions data on the 'state' column
    merged_df = pd.merge(df_names, df_clean_regions, on='state', how='left')
    
    # Group by clean_region, gender, and name, and sum the births
    grouped_df = merged_df.groupby(['clean_region', 'gender', 'name'], as_index=False)['births'].sum()
    
    return grouped_df.rename(columns={'births': 'num_b'})

# Step 3: Rank names by number of births within each region and gender
def rank_names_per_region(df_babies_per_reg):
    # Rank the names within each clean_region and gender based on total births
    df_babies_per_reg['rank_reg_pop'] = df_babies_per_reg.groupby(['clean_region', 'gender'])['num_b'].rank(method='first', ascending=False)
    
    # Filter to get only the top 3 names per region and gender
    ranked_df = df_babies_per_reg[df_babies_per_reg['rank_reg_pop'] <= 3]
    
    return ranked_df

# Applying the steps
df_clean_regions = clean_regions(df_regions)
df_babies_per_reg = get_babies_per_region(df_names, df_clean_regions)
df_ranked_babies = rank_names_per_region(df_babies_per_reg)

# Sorting the final result by clean_region, gender, and rank
df_ranked_babies_sorted = df_ranked_babies.sort_values(by=['clean_region', 'gender', 'rank_reg_pop']).reset_index(drop=True)

# Selecting relevant columns for the final output
final_result = df_ranked_babies_sorted[['clean_region', 'gender', 'name', 'rank_reg_pop']]

final_result

    clean_region gender         name  rank_reg_pop
0   Mid_Atlantic      F      Jessica           1.0
1   Mid_Atlantic      F       Ashley           2.0
2   Mid_Atlantic      F     Jennifer           3.0
3   Mid_Atlantic      M      Michael           1.0
4   Mid_Atlantic      M      Matthew           2.0
5   Mid_Atlantic      M  Christopher           3.0
6        Midwest      F      Jessica           1.0
7        Midwest      F       Ashley           2.0
8        Midwest      F        Sarah           3.0
9        Midwest      M      Michael           1.0
10       Midwest      M      Matthew           2.0
11       Midwest      M       Joshua           3.0
12      Mountain      F      Jessica           1.0
13      Mountain      F       Ashley           2.0
14      Mountain      F        Sarah           3.0
15      Mountain      M      Michael           1.0
16      Mountain      M       Joshua           2.0
17      Mountain      M  Christopher           3.0
18   New_England      F      Jessica           1.0
19   New_England      F        Sarah           2.0
20   New_England      F        Emily           3.0
21   New_England      M      Michael           1.0
22   New_England      M      Matthew           2.0
23   New_England      M  Christopher           3.0
24       Pacific      F      Jessica           1.0
25       Pacific      F     Jennifer           2.0
26       Pacific      F       Ashley           3.0
27       Pacific      M      Michael           1.0
28       Pacific      M  Christopher           2.0
29       Pacific      M       Daniel           3.0
30         South      F       Ashley           1.0
31         South      F      Jessica           2.0
32         South      F     Jennifer           3.0
33         South      M  Christopher           1.0
34         South      M      Michael           2.0
35         South      M       Joshua           3.0

#### <center> Explore unique names in the dataset </center>
Your final objective is to find the most popular androgynous names, the shortest and longest names, and the state with the highest percent of babies named "Chris". <br>
**Tasks**:
1. Find the 10 most popular androgynous names (names given to both females and males).
2. Find the length of the shortest and longest names, and identify the most popular short names (those with the fewest characters) and long names (those with the most characters).
3. The founder of Maven Analytics is named Chris. Find the state with the highest percent of babies named "Chris".

In [25]:
# Assuming `df` is your DataFrame
result = (
    df_names.groupby('name')
    .agg(num_andro=('gender', 'nunique'), num_babies=('births', 'sum'))
    .reset_index()
)

# Filter to keep only names with both genders (num_andro = 2)
result = result[result['num_andro'] == 2]

# Sort by total number of babies and get the top 10
result = result.sort_values(by='num_babies', ascending=False).head(10)

result

              name  num_andro  num_babies
14779      Michael          2     1382856
4187   Christopher          2     1122213
14397      Matthew          2     1034494
10272       Joshua          2      960170
9842       Jessica          2      865046
4878        Daniel          2      824208
5087         David          2      819479
2121        Ashley          2      792865
8947         James          2      766789
1394        Andrew          2      761824

In [29]:
# Step 1: Create a DataFrame with the length of each name
df_name_lenRec = df_names.groupby('name').agg(name_len=('name', lambda x: x.str.len().max())).reset_index()

# Step 2: Find the minimum and maximum name lengths
min_len = df_name_lenRec['name_len'].min()
max_len = df_name_lenRec['name_len'].max()

# Step 3: Filter names with minimum or maximum length
result = df_name_lenRec[df_name_lenRec['name_len'].isin([min_len, max_len])].sort_values(by='name_len').reset_index(drop = True)

result

               name  name_len
0                Ab         2
1                Pa         2
2                Oz         2
3                Om         2
4                No         2
..              ...       ...
68               Zi         2
69  Ryanchristopher        15
70  Johnchristopher        15
71  Mariadelosangel        15
72  Franciscojavier        15

[73 rows x 2 columns]

In [32]:
# Step 1: Calculate the minimum name length
min_len = df_names['name'].str.len().min()

# Step 2: Filter the DataFrame for names with either minimum or maximum length
short_long_names = df_names[df_names['name'].str.len() == min_len]

# Step 3: Group by 'Name' and calculate the total number of births for each name
result = short_long_names.groupby('name', as_index=False).agg(num_b=('births', 'sum'))

# Step 4: Sort by the total number of births in descending order
result = result.sort_values(by='num_b', ascending=False)

result

   name  num_b
56   Ty  29205
8    Bo   4737
25   Jo   1713
48   Pa   1096
3    Al    870
..  ...    ...
62   Wa      5
42   Mj      5
24   Ji      5
30   Ku      5
51   Su      5

[69 rows x 2 columns]

In [33]:
# Step 1: Calculate the maximum name length
max_len = df_names['name'].str.len().max()

# Step 2: Filter the DataFrame for names with either minimum or maximum length
short_long_names = df_names[df_names['name'].str.len() == max_len]

# Step 3: Group by 'Name' and calculate the total number of births for each name
result = short_long_names.groupby('name', as_index=False).agg(num_b=('births', 'sum'))

# Step 4: Sort by the total number of births in descending order
result = result.sort_values(by='num_b', ascending=False)

result

              name  num_b
0  Franciscojavier     52
3  Ryanchristopher     17
1  Johnchristopher      5
2  Mariadelosangel      5

In [35]:
# Step 1: Calculate total births for 'Chris' by state
chris_rec = df_names[df_names['name'] == 'Chris'].groupby('state', as_index=False).agg(num_chris=('births', 'sum'))

# Step 2: Calculate total births for all names by state
babies_rec = df_names.groupby('state', as_index=False).agg(num_babies=('births', 'sum'))

# Step 3: Merge the two DataFrames on 'State'
merged_df = pd.merge(chris_rec, babies_rec, on='state')

# Step 4: Calculate the percentage of 'Chris' births relative to total births
merged_df['chris_pct'] = (merged_df['num_chris'] / merged_df['num_babies']) * 100.0

# Step 5: Sort by 'chris_pct' in descending order
result = merged_df.sort_values(by='chris_pct', ascending=False)

# Display the result
result[['state', 'chris_pct']]

   state  chris_pct
17    LA   0.033539
10    HI   0.030136
32    NY   0.029555
40    TX   0.027989
3     CA   0.026825
29    NJ   0.025048
8     FL   0.020929
9     GA   0.019871
42    VA   0.019591
19    MD   0.018833
26    NC   0.018801
2     AZ   0.018639
34    OK   0.018273
13    IL   0.016160
1     AR   0.015618
30    NM   0.015189
31    NV   0.015105
4     CO   0.015001
0     AL   0.014296
39    TN   0.013926
5     CT   0.013584
43    WA   0.013465
37    SC   0.012756
24    MS   0.012510
21    MI   0.012503
18    MA   0.012374
15    KS   0.012373
22    MN   0.012292
14    IN   0.011868
6     DC   0.011492
36    PA   0.011456
41    UT   0.010877
23    MO   0.010810
16    KY   0.010463
33    OH   0.008778
35    OR   0.008345
27    ND   0.007910
11    IA   0.007180
28    NE   0.006965
44    WI   0.006909
20    ME   0.005472
25    MT   0.004591
7     DE   0.004125
38    SD   0.003324
12    ID   0.002171
45    WV   0.001805